Examinator/src/Catalogs/ФайлыСУЗ/ФайлыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФайлыСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.РесурсыСУЗ</owners>
  <attributes>
    <name>FlashВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FlashЦветФона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выравнивать</name>
    <type>
      <types>EnumRef.СпособыВыравниванияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьПоСсылке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьВнешнимПриложением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФайла</name>
    <type>
      <types>EnumRef.ТипыФайловСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроигрыватьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьОбработкуМодально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьОбработкуБезопасно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонДокумента</name>
    <type>
      <types>CatalogRef.ШаблоныДокументовСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ДанныеФайлыСУЗ/ДанныеФайлыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеФайлыСУЗ</name>
  <resources>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>CatalogRef.ФайлыСУЗПрисоединенныеФайлы</types>
    </type>
  </resources>
  <resources>
    <name>ТекстовыеДанные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДвоичныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОбмена</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыФайловСУЗ/ТипыФайловСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыФайловСУЗ</name>
  <enumValues>
    <name>Default</name>
  </enumValues>
  <enumValues>
    <name>Folder</name>
  </enumValues>
  <enumValues>
    <name>Media</name>
  </enumValues>
  <enumValues>
    <name>Image</name>
  </enumValues>
  <enumValues>
    <name>Video</name>
  </enumValues>
  <enumValues>
    <name>Audio</name>
  </enumValues>
  <enumValues>
    <name>Document</name>
  </enumValues>
  <enumValues>
    <name>DataProcessor</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ПодборкиСУЗ/ПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодборкиСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрезентация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбиратьЭлементыИзРубрикатора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяТеста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификационнаяГруппировка</name>
    <type>
      <types>CatalogRef.КлассификационныеГруппировкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьГруппыЭлементов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьКлассификатор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтартовуюСтраницу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЭлементов</name>
    <type>
      <types>EnumRef.ВариантыПредставленияЭлементовПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СвернутьРазделы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНавигации</name>
    <type>
      <types>EnumRef.ТипыНавигацииПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГруппЭлементов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартовыйРесурс</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыравниваниеСтартовогоРесурса</name>
    <type>
      <types>EnumRef.СпособыВыравниванияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТестирования</name>
    <type>
      <types>EnumRef.НазначенияТестированийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСложностиПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСложностиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТаймер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматТаймера</name>
    <type>
      <types>EnumRef.ФорматыТаймераСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйКомментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйРесурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НумероватьСтраницы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредыдущиеПопытки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьОткрытыеВопросы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтоимостьВопроса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьКомментарииВопросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияНаФинальнойСтранице</name>
    <type>
      <types>EnumRef.ИнформацияНаФинальнойСтраницеТестаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Презентация</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.РесурсыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ФайлыСУЗ/Forms/ФормаДокумента/Module.bsl
#Область ПеременныеФормы

// ПЕРЕМЕННЫЕ МОДУЛЯ

&НаКлиенте
Перем ТипОбъектаНаКлиенте; // Тип объекта метаданных в виде строки

&НаСервере
Перем ТипОбъектаНаСервере; // Тип объекта метаданных в виде строки

&НаКлиенте
Перем Приложение; // Объект COM приложения и другие его свойства

&НаКлиенте
Перем РабочийКаталог; // Каталог для хранения документа и его копии

&НаКлиенте
Перем Шаблоны; // Шаблоны и дополнения к документам

&НаКлиенте
Перем ПропуститьЗаписьДокумента; // Обработчик ПриЗаписиДокумента не будет срабатывать

&НаКлиенте
Перем ПропуститьСохранениеДокумента; // Процедура СохранитьДокумент из обработчика ПередЗаписью не будет срабатывать

&НаКлиенте
Перем ПерейтиКФормеРесурсаПередЗакрытием;

&НаКлиенте
Перем ПерейтиКФормеРесурсаПриЗакрытии;

#КонецОбласти

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Определяем родителя ресурса
	
	ЭлектронныйРесурс = Параметры.ЭлектронныйРесурс;
	Подборка          = Параметры.Подборка;
	РодительРесурса   = Параметры.РодительРесурса;
	ЭлементСодержания = Параметры.ЭлементСодержания;
	ЭлементПодборки   = Параметры.ЭлементПодборки;
	
	Если НЕ ЗначениеЗаполнено(РодительРесурса) Тогда
		
		Если ЗначениеЗаполнено(Параметры.Подборка) Тогда
			РодительРесурса = Справочники.ПодборкиСУЗ.ГруппаПодчиненныхЭлементов(Параметры.Подборка, "СправочникСсылка.РесурсыСУЗ", Параметры.ЭлектронныйРесурс);
		ИначеЕсли ЗначениеЗаполнено(Параметры.ЭлектронныйРесурс) Тогда
			РодительРесурса = Справочники.СводыЗнанийСУЗ.ГруппаДляХраненияПодчиненныхЭлементов(Параметры.ЭлектронныйРесурс, "СправочникСсылка.РесурсыСУЗ");
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если Объект.Ссылка.Пустая() Тогда		
		Объект.ТипФайла = Перечисления.ТипыФайловСУЗ.Document;		
	КонецЕсли;
	
	ОбновитьСсылкуНаЗагруженныйФайл();
	
	// Загружаем версию
	
	ЗагрузитьВерсиюНаСервере(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазработкаСУЗКлиент.УстановитьКонтекстЭлектронногоРесурса(ЭтотОбъект);
	
	РазработкаСУЗКлиент.УстановитьДоступностьЭлементовВерсииДанных(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(РодительРесурса) Тогда
		ПараметрыЗаписи.Вставить("РодительРесурса", РодительРесурса);
	КонецЕсли;

	ДокументДоступен = ДокументДоступен();
	
	Если НЕ ДокументДоступен И Объект.Ссылка.Пустая() И НЕ ПропуститьСохранениеДокумента Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Перед записью откройте новый документ'"));
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	Если ДокументДоступен И НЕ ПропуститьСохранениеДокумента Тогда
		СохранитьДокумент(Истина);
	КонецЕсли;
	
	ПропуститьСохранениеДокумента = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Для каждого Параметр Из ПараметрыЗаписи Цикл
		ТекущийОбъект.ДополнительныеСвойства.Вставить(Параметр.Ключ, Параметр.Значение);	
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект, Описание, "Описание", "ТекстовыеДанные");
	
	Если ФайлыДляСохранения <> Неопределено Тогда
		
		Для каждого ОписаниеФайла Из ФайлыДляСохранения Цикл
		
			ПереданныйФайл = Новый Файл(ОписаниеФайла.Имя);
			
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ОписаниеФайла.Хранение);
			
			Если ПереданныйФайл.Расширение = ".zip" Тогда
				
				РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект, ДвоичныеДанные, "HTML", "ДвоичныеДанные",,,"zip");
				
			Иначе	
				
				Если ЗначениеЗаполнено(ТекстовыеДанныеДляИндексирования) Тогда					
					
					ДанныеДляСохранения = Новый Структура;
					ДанныеДляСохранения.Вставить("ТекстовыеДанные", ТекстовыеДанныеДляИндексирования);
					ДанныеДляСохранения.Вставить("ДвоичныеДанные", ДвоичныеДанные);
					
					ИмяРеквизитаДляСохранения = "ВсеРеквизиты";
					
					РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект, ДанныеДляСохранения, "ДвоичныеДанные", ИмяРеквизитаДляСохранения);
					
				Иначе
					
					РазработкаСУЗ.СохранитьДвоичныеДанныеФайла(ТекущийОбъект, ДвоичныеДанные);
					
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЦикла;		
			
		ТекстовыеДанныеДляИндексирования = "";
		ФайлыДляСохранения = Неопределено;		
		
	КонецЕсли;	
	
	УстановитьДоступностьЭлементовФормыНаСервере();
	
	Если ЗначениеЗаполнено(ЭлементСодержания) Тогда
		Справочники.СодержаниеСУЗ.Перезаписать(ЭлементСодержания);
	КонецЕсли;

	Если ЗначениеЗаполнено(ЭлементПодборки) Тогда
		Справочники.ЭлементыПодборкиСУЗ.Перезаписать(ЭлементПодборки);	
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьСсылкуНаЗагруженныйФайл();
	
	РазработкаСУЗ.ПоказатьКоличествоВерсийОбъектаНаФорме(ЭтотОбъект, ТекущийОбъект);
	
	// Обновляем ссылки и зависимые ресурсы фоновым заданием
	
	МассивПараметровФЗ = Новый Массив;
	МассивПараметровФЗ.Добавить(Объект.Владелец);
	
	ФоновыеЗадания.Выполнить("РазработкаСУЗ.ОбновитьГиперссылкиРесурса", МассивПараметровФЗ);	
	
	Если ТипЗнч(ЗависимыеРесурсыДляСохранения) = Тип("ФиксированныйМассив") Тогда
		ФоновыеЗадания.Выполнить("РазработкаСУЗ.ОбновитьЗависимыеРесурсы", Новый Массив(ЗависимыеРесурсыДляСохранения));		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РазработкаСУЗКлиент.УстановитьДоступностьЭлементовВерсииДанных(ЭтотОбъект);
	
	Оповестить("ОбъектСУЗЗаписан", Объект.Ссылка, ЭтотОбъект);
	Оповестить("РесурсЗаписан", Объект.Владелец, ЭтотОбъект); // Всегда
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		Оповестить("ЭлектронныйРесурсОбновлен", ЭлектронныйРесурс, ЭтотОбъект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Подборка) Тогда
		Оповестить("ПодборкаОбновлена", Подборка, ЭтотОбъект);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если ДокументМодифицирован() Тогда
		Модифицированность = Истина;
	КонецЕсли;		
	
	Если ПерейтиКФормеРесурсаПередЗакрытием Тогда
		ПерейтиКФормеРесурсаПриЗакрытии = Истина;
	Иначе
		ПерейтиКФормеРесурсаПриЗакрытии = Ложь;
	КонецЕсли;
	
	ПерейтиКФормеРесурсаПередЗакрытием = Ложь;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()	
	
	Если Приложение <> Неопределено Тогда
		
		Если Приложение.Пользовательское <> Неопределено Тогда
		
			Попытка
				УдалитьОбработчик Приложение.Пользовательское.Quit, ПриЗакрытииВнешнегоПриложения;	
				УдалитьОбработчик Приложение.Пользовательское.DocumentBeforeSave, ПриЗаписиДокумента;	
				УдалитьОбработчик Приложение.Пользовательское.DocumentBeforeClose, ПриЗакрытииДокумента;	
			Исключение		
			КонецПопытки;
			
			Если Приложение.Документ <> Неопределено Тогда
			
				Попытка
					Приложение.Документ.Close(0);
				Исключение		
				КонецПопытки;
				
			КонецЕсли;		
			
			Попытка	
				Приложение.Пользовательское.Quit(0);
			Исключение		
			КонецПопытки;

		КонецЕсли;
			
		Если Приложение.Скрытое <> Неопределено Тогда
		
			Попытка
				Приложение.Скрытое.Quit(0);
			Исключение		
			КонецПопытки;

		КонецЕсли;		
		
		Приложение = Неопределено;
		
	КонецЕсли;
	
		
	Если РабочийКаталог <> Неопределено Тогда
		
		Попытка
			УдалитьФайлы(РабочийКаталог.Путь);
		Исключение		
		КонецПопытки;
		
	КонецЕсли;
	
	Если ПерейтиКФормеРесурсаПриЗакрытии Тогда
		ПараметрыФормы =  Новый Структура("Ключ, РежимВыбора, ОткрытьФормуРесурса, ЭлектронныйРесурс, Подборка, ЭлементПодборки, ЭлементСодержания", Объект.Владелец, РежимВыбора, Истина, ЭлектронныйРесурс, Подборка, ЭлементПодборки, ЭлементСодержания);
		ОткрытьФорму("Справочник.РесурсыСУЗ.ФормаОбъекта", ПараметрыФормы, ВладелецФормы);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОткрытьДокументWord(Команда)

	#Если НЕ ВебКлиент Тогда

	Если НЕ РазработкаСУЗКлиент.ЕстьПоддержкаДокументов() Тогда	
		Возврат;
	КонецЕсли;
	
	// Инициализируем приложение
	//
	
	Если Приложение = Неопределено Тогда
		Приложение = Новый Структура("Пользовательское, Скрытое, Версия, Документ, РасширениеПодключено", Неопределено, Неопределено, Неопределено, Неопределено, Ложь);
	КонецЕсли;
	
	Если НЕ ПриложениеДоступно(Приложение.Пользовательское) Тогда
		
		Попытка
			Приложение.Пользовательское = Новый COMObject("Word.Application");		
		Исключение
			Приложение.Пользовательское = Неопределено;
		КонецПопытки;			
		
	КонецЕсли;	
	
	Если НЕ ПриложениеДоступно(Приложение.Скрытое) Тогда
		
		Попытка
			Приложение.Скрытое = Новый COMObject("Word.Application");		
		Исключение
			Приложение.Скрытое = Неопределено;
		КонецПопытки;
		
		Приложение.Скрытое.Visible = Ложь;
		
	КонецЕсли;	
	
	Если НЕ ПриложениеДоступно(Приложение.Пользовательское)
		ИЛИ НЕ ПриложениеДоступно(Приложение.Скрытое) Тогда
		
		Приложение = Неопределено;		
		ПоказатьПредупреждение(,НСтр("ru = 'Ошибка инициализации приложения'"));		
		Возврат;
		
	КонецЕсли;
	
	Если Приложение.Версия = Неопределено Тогда
		Приложение.Версия = Число(ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(Приложение.Пользовательское.Version, ".")[0]);	
	КонецЕсли;
	
	// Загружаем шаблоны
	//
	
	Если Шаблоны = Неопределено Тогда
		Шаблоны = Новый Структура("ПутьККаталогу, Пользовательские");	
	КонецЕсли;

	// Получаем путь к каталогу с шаблонами
	
	Если Шаблоны.ПутьККаталогу = Неопределено Тогда
	
		ShellApp = Новый COMОбъект("shell.application");				
		Folder = ShellApp.Namespace(21);
		
		Шаблоны.ПутьККаталогу = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(Folder.Self.Path);

	КонецЕсли;
	
	// Подключаем пользовательские шаблоны
	
	Если Шаблоны.Пользовательские = Неопределено Тогда
	
		ПользовательскиеШаблоныФикс = РазработкаСУЗ.ПользовательскиеШаблоныДокументов();	
		
		Шаблоны.Пользовательские = Новый Массив;
		
		Для каждого ШаблонФикс Из ПользовательскиеШаблоныФикс Цикл
			
			Шаблон = Новый Структура(ШаблонФикс);
			
			ПутьКФайлуШаблона = Шаблоны.ПутьККаталогу + Строка(Шаблон.Ссылка.УникальныйИдентификатор());
			ПутьКФайлуШаблона = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКФайлуШаблона);	
			ПутьКФайлуШаблона = ПутьКФайлуШаблона + Шаблон.ИмяФайла;
			
			Шаблон.Вставить("ПутьКФайлу", ПутьКФайлуШаблона);
			
			ФайлШаблона = Новый Файл(ПутьКФайлуШаблона);
			
			Если НЕ ФайлШаблона.Существует() ИЛИ ФайлШаблона.ПолучитьВремяИзменения() < Шаблон.ДатаИзменения Тогда
				
				МассивФайлов = Новый Массив;					
				МассивФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(Шаблон.ИмяФайла, ПолучитьНавигационнуюСсылку(Шаблон.Ссылка, "ДвоичныеДанные")));
								
				ПолучитьФайлы(МассивФайлов,,ФайлШаблона.Путь, Ложь); 
				
				Если ФайлШаблона.Существует() Тогда
					ФайлШаблона.УстановитьВремяИзменения(Шаблон.ДатаИзменения);
				КонецЕсли;
				
			КонецЕсли;
			
			Шаблоны.Пользовательские.Добавить(Шаблон);
			
		КонецЦикла;
		
	КонецЕсли;		
	
	// Открываем документ
	//
	
	// Формируем рабочий каталог для работы с документом
	
	Если РабочийКаталог = Неопределено Тогда
		
		РабочийКаталог = Новый Структура("Путь, Документ, Копия, ФайлДляСохранения");
		
		РабочийКаталог.Путь = ПолучитьИмяВременногоФайла("");
		
		СоздатьКаталог(РабочийКаталог.Путь);
		
		РабочийКаталог.Путь = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог.Путь);			
		
		// Путь для сохранения документа
		
		РабочийКаталог.Документ = РабочийКаталог.Путь + "doc";
		
		СоздатьКаталог(РабочийКаталог.Документ);
		
		РабочийКаталог.Документ = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог.Документ);			
		
		// Путь для хранения копии документа
		
		РабочийКаталог.Копия = РабочийКаталог.Путь + "copy";
		
		СоздатьКаталог(РабочийКаталог.Копия);
		
		РабочийКаталог.Копия = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог.Копия);		
		
	КонецЕсли;		
	
	// Открываем документ в пользовательском приложении
	
	Если НЕ ДокументДоступен() Тогда
	
		ДобавитьОбработчик Приложение.Пользовательское.Quit, ПриЗакрытииВнешнегоПриложения;
		ДобавитьОбработчик Приложение.Пользовательское.DocumentBeforeSave, ПриЗаписиДокумента;	
		ДобавитьОбработчик Приложение.Пользовательское.DocumentBeforeClose, ПриЗакрытииДокумента;
		
		СвойстваШаблона = Неопределено;
		
		Если ЗначениеЗаполнено(Объект.ШаблонДокумента) Тогда
			
			Для каждого ПользовательскийШаблонСвойства Из Шаблоны.Пользовательские Цикл
				Если ПользовательскийШаблонСвойства.Ссылка = Объект.ШаблонДокумента Тогда
					СвойстваШаблона = ПользовательскийШаблонСвойства;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;	
		
		Если СсылкаНаЗагруженныйФайл = Неопределено Тогда // Нет файла для открытия
		
			Если СвойстваШаблона = Неопределено Тогда		
				Приложение.Документ = Приложение.Пользовательское.Documents.Add();
			Иначе
				Приложение.Документ = Приложение.Пользовательское.Documents.Add(СвойстваШаблона.ПутьКФайлу);
			КонецЕсли;	
			
			Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
				Объект.Наименование = НСтр("ru = 'Документ'");
			КонецЕсли;

			ПропуститьЗаписьДокумента = Истина;
			
			Если Приложение.Версия < 12 Тогда
				
				Если Приложение.Версия < 11 Тогда
					
					Приложение.Документ.SaveAs2000(РабочийКаталог.Документ + Объект.Наименование + ".doc", 0,,,Ложь);
					
				Иначе
					
					Приложение.Документ.SaveAs(РабочийКаталог.Документ + Объект.Наименование + ".doc", 0,,,Ложь);
					
				КонецЕсли;
				
			Иначе
				
				Приложение.Документ.SaveAs(РабочийКаталог.Документ + Объект.Наименование, 16,,, Ложь);
				
			КонецЕсли;		
			
		Иначе
			
			ПолучитьФайл(СсылкаНаЗагруженныйФайл, РабочийКаталог.Документ + Объект.ИмяФайла, Ложь);
			
			Приложение.Документ = Приложение.Пользовательское.Documents.Open(РабочийКаталог.Документ + Объект.ИмяФайла,,,Ложь);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Определяем видимость приложения
	//
	
	Приложение.Пользовательское.Visible = Истина;
	
	Приложение.Пользовательское.WindowState = 2;
	Приложение.Пользовательское.WindowState = 1;	
	
#КонецЕсли	
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВФормуРесурса(Команда)
	
	ПерейтиКФормеРесурсаПередЗакрытием = Истина;
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура АрхивВерсий(Команда)
	РазработкаСУЗКлиент.ОткрытьВерсииОбъекта(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВерсию(Команда)
	
	Если ДокументДоступен() ИЛИ Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		
		ПоказатьПредупреждение(,НСтр("ru = 'Перед созданием новой версии сохраните документ и закройте его'"));
		
		Возврат;
		
	КонецЕсли;
	
	ОбновитьСсылкуНаЗагруженныйФайл();
	
	ОткрытьДокументWord(Неопределено);
	
	СтруктураНовойВерсии = РазработкаСУЗ.ПолучитьСтруктуруНовойВерсииОбъекта(Объект, ТипОбъектаНаКлиенте);
	РазработкаСУЗКлиент.СоздатьВерсиюОбъекта(ЭтотОбъект, СтруктураНовойВерсии);		
	
	ОбновитьСсылкуНаЗагруженныйФайл();
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Свойства приложения

&НаКлиенте
Функция ПриложениеДоступно(ПриложениеCOM)
	
	Возврат ОбщегоНазначенияСУКлиент.ПриложениеCOMДоступно(ПриложениеCOM);
	
КонецФункции

&НаКлиенте
Функция ДокументДоступен()
	
	Если Приложение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Приложение.Документ = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Если НЕ ПриложениеДоступно(Приложение.Пользовательское) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ПриложениеДоступно(Приложение.Скрытое) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяДокумента = Неопределено;
	
	Попытка
		ИмяДокумента = Приложение.Документ.Name;
	Исключение
		Приложение.Документ = Неопределено;
	КонецПопытки;
	
	Возврат ?(ИмяДокумента = Неопределено, Ложь, Истина);
	
КонецФункции

&НаКлиенте
Функция ДокументМодифицирован()
	
	Если НЕ ДокументДоступен() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Приложение.Документ.Saved Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// События приложения

&НаКлиенте
Процедура ПриЗакрытииВнешнегоПриложения()   
	// Не требуется
КонецПроцедуры

&НаКлиенте
Процедура ПриЗаписиДокумента(Document, SaveAsUI, Cancel)   
	
	Если ПропуститьЗаписьДокумента Тогда
		ПропуститьЗаписьДокумента = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Document = Приложение.Документ И НЕ SaveAsUI Тогда
		Cancel = Истина;				
		СохранитьДокумент(Ложь);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииДокумента(Document, Cancel)   
	// Не требуется			
КонецПроцедуры

// Действия с документом

&НаКлиенте
Процедура СохранитьДокумент(Синхронно)

	// Сохраняем документ
	
	ПропуститьЗаписьДокумента = Истина;
	
	Приложение.Документ.Save();
	
	ПропуститьЗаписьДокумента = Ложь;
	
	// Делаем копию документа	
	
	Объект.ИмяФайла = Приложение.Документ.Name;
	
	РабочийКаталог.ФайлДляСохранения = РабочийКаталог.Копия + Объект.ИмяФайла;
	
	КопироватьФайл(Приложение.Документ.FullName, РабочийКаталог.ФайлДляСохранения);
	
	// Сохраняем копию в HTML
	
	Если Синхронно Тогда
		СохранитьДокументПродолжение();
	Иначе
		ПодключитьОбработчикОжидания("СохранитьДокументПродолжение", 0.01, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДокументПродолжение()
	
	Если НЕ ЗначениеЗаполнено(РабочийКаталог.ФайлДляСохранения) Тогда
		Возврат;
	КонецЕсли;		
	
	ПропуститьСохранениеДокумента = Истина;
	
	ПараметрыЗагрузки = Новый Структура();	
	
	// Свойства загрузки
	
	ПараметрыЗагрузки.Вставить("ПутьКДокументу", РабочийКаталог.ФайлДляСохранения);
	ПараметрыЗагрузки.Вставить("Приложение", Приложение.Скрытое);
	ПараметрыЗагрузки.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ПараметрыЗагрузки.Вставить("КонтекстФайла", "");
	
	// Параметры для заполнения в процессе загрузки
	
	ПараметрыЗагрузки.Вставить("ЗависимыеРесурсы", Новый Массив);	
	ПараметрыЗагрузки.Вставить("ЗависимыеРесурсыДополняющиеAPI", Новый Массив);		
	ПараметрыЗагрузки.Вставить("ПереданныеФайлы", Новый Массив);	
	ПараметрыЗагрузки.Вставить("НастройкиКартинок", РазработкаСУЗКлиент.НовоеОписаниеКартинокДокумента());	
	ПараметрыЗагрузки.Вставить("ПередаваемыеФайлы", Новый Массив);
	ПараметрыЗагрузки.Вставить("СтруктураФайлов", Новый Массив);
	ПараметрыЗагрузки.Вставить("ТекстовыеДанныеДляИндексирования", "");
	
	РазработкаСУЗКлиент.СформироватьДокументДляСохраненияВБазе(ПараметрыЗагрузки);
	
	Описание = РазработкаСУЗ.ОписаниеДокумента(ПараметрыЗагрузки.НастройкиКартинок);		
	ФайлыДляСохранения    = Новый Фиксированныймассив(ПараметрыЗагрузки.ПереданныеФайлы); // Сохраняем в реквизит
	ТекстовыеДанныеДляИндексирования = ПараметрыЗагрузки.ТекстовыеДанныеДляИндексирования;
	
	РабочийКаталог.ФайлДляСохранения = Неопределено;
	
	МассивПараметровФЗ = Новый Массив;
	МассивПараметровФЗ.Добавить(Объект.Владелец);
	МассивПараметровФЗ.Добавить(Новый ФиксированныйМассив(ПараметрыЗагрузки.ЗависимыеРесурсы));
	МассивПараметровФЗ.Добавить(Новый ФиксированныйМассив(ПараметрыЗагрузки.ЗависимыеРесурсыДополняющиеAPI));
	
	ЗависимыеРесурсыДляСохранения = Новый ФиксированныйМассив(МассивПараметровФЗ); // Сохраняем в реквизит и будем использовать после сохранения	
	
	Записать();
	
КонецПроцедуры

// Действия в форме

// Устанавливаем реквизит формы СсылкаНаЗагруженныйФайл,
// который хранит ссылку на документ, сохраненный в базе.
//
&НаСервере
Процедура ОбновитьСсылкуНаЗагруженныйФайл()
	
	СсылкаНаЗагруженныйФайл = РегистрыСведений.ДанныеФайлыСУЗ.АдресХраненияДвоичныхДанных(Объект.Ссылка, Объект.Поставщик, Объект.Версия, "ДвоичныеДанные", УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормыНаСервере()	
	// Не требуется	
КонецПроцедуры

// Данные для расширения

&НаСервереБезКонтекста
Функция ДанныеДляДополнения(ЭлектронныйРесурс)
	
	СтруктураДанных = Новый Структура("Items, hiddenRes", Новый Массив, Новый Массив);
	
	// Элементы содержания
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СодержаниеСУЗ.Ссылка КАК Ссылка,
		|	СодержаниеСУЗ.СсылкаНаЭлемент КАК СсылкаНаЭлемент,
		|	СодержаниеСУЗ.Наименование,
		|	СодержаниеСУЗ.ЭтоГруппа,
		|	СодержаниеСУЗ.Карта,
		|	СодержаниеСУЗ.Родитель,
		|	СодержаниеСУЗ.Владелец КАК ЭлектронныйРесурс
		|ИЗ
		|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
		|ГДЕ
		|	СодержаниеСУЗ.Владелец = &ЭлектронныйРесурс
		|	И СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеСУЗ.Код ИЕРАРХИЯ";

	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);

	Результат = Запрос.Выполнить();

	ДеревоЭлементовСодержания = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ДобавитьЭлементСодержанияВСписок(СтруктураДанных.Items, ДеревоЭлементовСодержания.Строки);
	
	// Скрытые ресурсы
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СводыЗнанийСУЗСкрытыеРесурсы.Ресурс
		|ИЗ
		|	Справочник.СводыЗнанийСУЗ.СкрытыеРесурсы КАК СводыЗнанийСУЗСкрытыеРесурсы
		|ГДЕ
		|	СводыЗнанийСУЗСкрытыеРесурсы.Ссылка = &ЭлектронныйРесурс
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		РесурсДляПросмотра = Справочники.СводыЗнанийСУЗ.СкрытыйРесурсДляПросмотра(ВыборкаДетальныеЗаписи.Ресурс);
		РесурсДляРедактирования = Справочники.СводыЗнанийСУЗ.СкрытыйРесурсДляРедактирования(ВыборкаДетальныеЗаписи.Ресурс);
		ТипРесурсаДляРедактирования = Справочники.СводыЗнанийСУЗ.ТипСкрытогоРесурсаДляРедактирования(РесурсДляРедактирования);
		
		ОписаниеЭлемента = Новый Структура(
			"ID, NAME, TYPE",
			ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(РесурсДляПросмотра, ""),
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РесурсДляРедактирования, "Наименование"),
			ТипРесурсаДляРедактирования
		);
		
		СтруктураДанных.hiddenRes.Добавить(ОписаниеЭлемента);
		
	КонецЦикла;

	
	Возврат СтруктураДанных;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьЭлементСодержанияВСписок(МассивЭлементов, СтрокиДерева)
	
	Если СтрокиДерева.Количество() > 0 Тогда
			
		Для каждого Строка Из СтрокиДерева Цикл
			
			Если Строка.ЭтоГруппа Тогда
				СсылкаНаЭлемент = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(Строка.Ссылка, "");
			Иначе
				СсылкаНаЭлемент = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(Строка.СсылкаНаЭлемент, "");
			КонецЕсли;
			
			ОписаниеЭлемента = Новый Структура("ID, NAME, ITEMS", СсылкаНаЭлемент, Строка.Наименование, Новый Массив);
			
			Если Строка.ЭтоГруппа Тогда
				ДобавитьЭлементСодержанияВСписок(ОписаниеЭлемента.ITEMS, Строка.Строки)
			КонецЕсли;
			
			МассивЭлементов.Добавить(ОписаниеЭлемента);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ПрограммныйИнтерфейс

// ПРОГРАММНЫЙ ИНТЕРФЕЙС

&НаКлиенте
// Загружает данные текущей версии объекта для редактирования.
// Вызывается из общей формы "ВерсииОбъектаСУЗ" и после инициализации редактора.
//
Процедура ЗагрузитьВерсию() Экспорт
	
	ЗагрузитьВерсиюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВерсиюНаСервере(ПерваяЗагрузка = Ложь) Экспорт
	
	//////////////////////////////////////////////////////////////////
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект);
	//////////////////////////////////////////////////////////////////
	
	ТипОбъекта = Тип(ТипОбъектаНаСервере);
	
	РазработкаСУЗ.ПоказатьКоличествоВерсийОбъектаНаФорме(ЭтотОбъект, Объект, ТипОбъекта);
	
	Описание  = ОбъектыСУЗ.ПолучитьДанные(Объект.Ссылка, "Описание");
	
	Если НЕ ПерваяЗагрузка Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Статус = НСтр("ru = 'Данные отсутствуют'", "ru");
		
		СтруктураНовойВерсии = РазработкаСУЗ.ПолучитьСтруктуруНовойВерсииОбъекта(Объект, ТипОбъектаНаСервере);
		
		Объект.Версия    = СтруктураНовойВерсии.Версия;
		Объект.Поставщик = СтруктураНовойВерсии.Поставщик;
		
		Элементы.Поставщик.ТолькоПросмотр  = Ложь;
		Элементы.Версия.ТолькоПросмотр     = Ложь;
		Элементы.СоздатьВерсию.Доступность = Ложь;
		
	Иначе
		
		Статус = НСтр("ru = 'Данные размещены в базе данных'", "ru");
		
		Элементы.Поставщик.ТолькоПросмотр  = Истина;
		Элементы.Версия.ТолькоПросмотр     = Истина;
		Элементы.СоздатьВерсию.Доступность = Истина;
		
	КонецЕсли;	
	
	УстановитьДоступностьЭлементовФормыНаСервере();
	
	ОбновитьСсылкуНаЗагруженныйФайл();
	
КонецПроцедуры

#КонецОбласти

#Область ОператорыОсновнойПрограммы

// УСТАНОВКА ЗНАЧЕНИЙ ПЕРЕМЕННЫХ

ТипОбъектаНаКлиенте = "СправочникОбъект.ФайлыСУЗ"; 
ТипОбъектаНаСервере = "СправочникОбъект.ФайлыСУЗ";

ПропуститьЗаписьДокумента = Ложь;
ПропуститьСохранениеДокумента = Ложь;
ПерейтиКФормеРесурсаПриЗакрытии = Ложь;
ПерейтиКФормеРесурсаПередЗакрытием = Ложь;


#КонецОбласти
